app/views/tasks/index.html.erb

<h4>To Do:</h4>
<ul><% Task.all_incompletes.each do |v| %>
---
SELECT "tasks".* FROM "tasks"