app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."uid" = ? AND "users"."provider" = ? LIMIT 1  [["uid", 17463068], ["provider", "github"]]
INSERT INTO "users" ("uid", "provider", "name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["uid", 17463068], ["provider", "github"], ["name", "Nicole"], ["email", "nicole.url.4@gmail.com"], ["created_at", "2016-10-17 22:07:56.876540"], ["updated_at", "2016-10-17 22:07:56.876540"]]
---
  def create
    auth_hash = request.env['omniauth.auth']
    redirect_to login_path unless auth_hash[:uid]

    @user = User.find_by(uid: auth_hash[:uid], provider: "github")
    if @user.nil?
      @user = User.create_from_github(auth_hash)