app/controllers/tasks_controller.rb

  def index
    tasks = Task.all.where(user_id: session[:user_id])

    @completed_tasks = tasks.where.not(completed_at: nil)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 17463068]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND ("tasks"."completed_at" IS NOT NULL)  [["user_id", 17463068]]

  def create
    if (@task = Task.create(task_params))
      @task.user_id = session[:user_id]
      @task.save
---
INSERT INTO "tasks" ("name", "description", "completed_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "asdflkjas"], ["description", "lksadjf;lkajsdflksa"], ["completed_at", "2016-09-07"], ["created_at", "2016-09-30 16:36:51.590090"], ["updated_at", "2016-09-30 16:36:51.590090"]]
UPDATE "tasks" SET "user_id" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["user_id", 17463068], ["updated_at", "2016-10-23 00:17:54.995228"], ["id", 3]]

  def update
    if @task.update(task_params)
---
UPDATE "tasks" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["name", "books"], ["description", "Return all your library books"], ["updated_at", "2016-09-29 23:51:28.610413"], ["id", 9]]

  def complete
    @task.completed_at = Date.today
    @task.save
---
UPDATE "tasks" SET "completed_at" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed_at", "-4712-01-01"], ["updated_at", "2016-09-30 20:52:05.124819"], ["id", 1]]

  def destroy
    @task = Task.find(params[:id]).destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 2]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 2]]

  def find_task
    @task = Task.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 9]]